---
kind: other
id: Methods.T:Autodesk.Revit.DB.Mechanical.MEPBuildingConstructionSetIterator
source: html/2f0d2c53-386e-0619-5a8f-60b2c0fc3343.htm
---
# MEPBuildingConstructionSetIterator Methods

Causes the object to release immediately any resources it may be utilizing.